Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: For example, a value of 723 KB is formatted as 723.
ja: 例えば、723 KB の値は723のように書式設定されます。

source: For example, a value of 723 KB is formatted as KB.
ja: 例えば、723 KB の値はKBのように書式設定されます。

source: For example, an application like TextEdit can use this option when creating new file wrappers to represent attachments that the user creates by copying and pasting or dragging and dropping from the Finder to a TextEdit document.
ja: 例えば、TextEditのようなアプリケーションは、ユーザがFinderからTextEdit書類にコピー＆ペーストまたはドラッグ＆ドロップすることで作成する、さまざまな添付書類を表すために新しいファイルラッパーを作成する場合は、このオプションを使うことができます。

source: For example, an application wouldn't use this option when creating file wrappers to represent attachments as it's opening a document stored in a file package.
ja: 例えば、あるアプリケーションは、それがファイルパッケージの中に格納される書類を開こうとして、さまざまな添付書類を表すためにファイルラッパーを作成する場合は、このオプションを使わないでしょう。

source: For example, an array of NSString objects can be sorted by using the case Insensitive Compare(_:) method declared in the NSString class.
ja: 例えば、NSStringオブジェクトからなるある配列は、NSStringクラスの中で宣言されるcase Insensitive Compare(_:)メソッドを使うことによってソートされることができます。

source: For example, assuming the current calendar or ignoring certain values.
ja: 例えば、現在のカレンダーを仮定するまたは特定の値を無視するなど。

source: For example, because the contents of bundles (not all file packages are bundles) are immutable to the user, NSFile Wrapper may read the children of such a directory lazily.
ja: 例えば、バンドル（すべてのファイルパッケージがバンドルではありません）の内容はユーザにとって変えられないことから、NSFile Wrapperはそのようなディレクトリの子を遅延に読み出すでしょう。

source: For example, consider the value of one hour formatted using the positional and abbreviated unit styles.
ja: 例えば、位置のそして省略される単位スタイルを使って書式設定された１時間の値を考えてください。

source: For example, don't use this option in an override of -[NSDocument write(to: of Type:)], because NSDocument safe-saving is already done atomically.
ja: 例えば、このオプションを-[NSDocument write(to: of Type:)]のオーバーライドに使わないでください、なぜならNSDocumentの安全な保存は、既に自動的に行われるからです。

source: For example, during a daylight saving transition there may be no 2:37am.
ja: 例えば、サマータイムの変わり目には2:37amはないかもしれません。

source: For example, for English in the Gregorian calendar, returns "AM".
ja: 例えば、グレゴリオ暦での英語に対して、"AM"を返します。

source: For example, for English in the Gregorian calendar, returns "PM".
ja: 例えば、グレゴリオ暦での英語に対して、"PM"を返します。

source: For example, for English in the Gregorian calendar, returns ["1st quarter", "2nd quarter", "3rd quarter", "4th quarter"].
ja: 例えば、グレゴリオ暦での英語に対して、["1st quarter", "2nd quarter", "3rd quarter", "4th quarter"]を返します。

source: For example, for English in the Gregorian calendar, returns ["BC", "AD"].
ja: 例えば、グレゴリオ暦での英語に対して、["BC", "AD"]を返します。

source: For example, for English in the Gregorian calendar, returns ["Before Christ", "Anno Domini"].
ja: 例えば、グレゴリオ暦での英語に対して、["Before Christ", "Anno Domini"]を返します。

source: For example, for English in the Gregorian calendar, returns ["J", "F", "M", "A", "M", "J", "J", "A", "S", "O", "N", "D"].
ja: 例えば、グレゴリオ暦での英語に対して、["J", "F", "M", "A", "M", "J", "J", "A", "S", "O", "N", "D"]を返します。

source: For example, for English in the Gregorian calendar, returns ["Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"].
ja: 例えば、グレゴリオ暦での英語に対して、["Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"]を返します。

source: For example, for English in the Gregorian calendar, returns ["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"].
ja: 例えば、グレゴリオ暦での英語に対して、["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"]を返します。

source: For example, for English in the Gregorian calendar, returns ["Q1", "Q2", "Q3", "Q4"].
ja: 例えば、グレゴリオ暦での英語に対して、["Q1", "Q2", "Q3", "Q4"]を返します。

source: For example, for English in the Gregorian calendar, returns ["S", "M", "T", "W", "T", "F", "S"].
ja: 例えば、グレゴリオ暦での英語に対して、["S", "M", "T", "W", "T", "F", "S"]を返します。

source: For example, for English in the Gregorian calendar, returns ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"].
ja: 例えば、グレゴリオ暦での英語に対して、["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"]を返します。

source: For example, for English in the Gregorian calendar, returns ["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"].
ja: 例えば、グレゴリオ暦での英語に対して、["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"]を返します。

source: For example, for English, when formatting "3 pounds": long is "3 pounds"; medium is "3 lb"; short is "3#".
ja: 例えば、英語に対して、"3 pounds" を書式設定する場合：long は "3 pounds"；medium は "3 lb"；short は "3#" です。

source: For example, for an Date Components with just a year and a month specified, a day of 1, and an hour, minute, second, and nanosecond of 0 are assumed.
ja: 例えば、ただyearとmonthを指定されるだけのDate Componentsに対して、１のday、そして０のhour、minute、second、そしてnanosecondが仮定されます。

source: For example, formatting the date January 15, 2015 with this style results in the value “1/15/15” for US English and the value “15.1.15” for German.
ja: 例えば、日付 January 15, 2015 をこのスタイルで書式設定することは、米国語に対しては値 “1/15/15” そして独語に対しては値 “15.1.15” という結果になります。

source: For example, formatting the date January 15, 2015 with this style results in the value “Jan 15, 2015” for US English and the value “15. Jan. 2015” for German.
ja: 例えば、日付 January 15, 2015 をこのスタイルで書式設定することは、米国語に対しては値 “Jan 15, 2015” そして独語に対しては値 “15. Jan. 2015” という結果になります。

source: For example, formatting the date January 15, 2015 with this style results in the value “January 15, 2015” for US English and the value “15. Januar 2015” for German.
ja: 例えば、日付 January 15, 2015 をこのスタイルで書式設定することは、米国語に対しては値 “January 15, 2015” そして独語に対しては値 “15. Januar 2015” という結果になります。

source: For example, formatting the date January 15, 2015 with this style results in the value “Thursday, January 15, 2015” for US English and the value “Donnerstag, 15. Januar 2015” for German.
ja: 例えば、日付 January 15, 2015 をこのスタイルで書式設定することは、米国語に対しては値 “Thursday, January 15, 2015” そして独語に対しては値 “Donnerstag, 15. Januar 2015” という結果になります。

source: For example, here My Class adopts the (fictitious) Affiliation Requests and Normalization protocols:
ja: 例えば、ここにあるMy Classは、（架空の）Affiliation RequestsとNormalizationプロトコルを採用します：

source: For example, here the Affiliation Requests protocol incorporates the Joining protocol:
ja: 例えば、ここでAffiliation RequestsプロトコルはJoiningプロトコルを取り入れます：

source: For example, if after decoding an object you discover that an equivalent object already exists, you can return the existing object.
ja: 例えば、あるオブジェクトのデコードの後に同等なオブジェクトが既に存在することをあなたが発見するならば、あなたは既存のオブジェクトを返すことができます。

source: For example, if an IndexSet is composed of: [1..<5] and [7..<10] and [13] then calling next() on this view’s iterator will produce 3 ranges before returning nil.
ja: 例えば、あるIndexSetが次で構成されるならば：[1..<5]と[7..<10]と[13]、その時next()をこのビューの持つイテレータ上で呼び出すことは、nilを返す前に３つの範囲を生成します。

source: For example, if changing the weekday to Thursday, does that move forward to the next, backward to the previous, or to the nearest Thursday?
ja: 例えば、曜日を「木曜日」に変更することは、次へと将来に、前へと過去に、または近い方の「木曜日」へと移動を行うでしょうか？

source: For example, if minutes are not allowed, the value “1h 30m” could be formatted as “1.5h”.
ja: 例えば、分が許可されないならば、値 “1h 30m” は “1.5h” のように書式設定できるでしょう。

source: For example, if searching for Feb 29 in the Gregorian calendar, the algorithm may choose March 1 instead (for example, if the year is not a leap year).
ja: 例えば、２月29日をグレゴリオ暦で検索するとしたら、アルゴリズムは代わりに３月１日を選択するかもしれません（例えば、その年が閏年でないならば）

source: For example, if the time Style property was set to none, the two dates would need to be at least one day apart in order for both to be displayed.
ja: 例えば、time Styleプロパティがnoneに設定されたならば、２つの日付は、両方が表示されるために少なくとも１日は離れる必要があるでしょう。

source: For example, if the bytes of inv are numbered from 1 to 4, this function swaps bytes 1 and 4, and bytes 2 and 3.
ja: 例えば、invのバイトが１から4に順番付けられるならば、この関数はバイト１と４、そしてバイト２と３をスワップします。

source: For example, if the bytes of inv are numbered from 1 to 8, this function swaps bytes 1 and 8, bytes 2 and 7, bytes 3 and 6, and bytes 4 and 5.
ja: 例えば、invのバイトが１から８に順番付けられるならば、この関数はバイト１と８、バイト２と７、バイト３と６、そしてバイト４と５をスワップします。

source: For example, if the bytes of x are numbered from 1 to 4, this function swaps bytes 1 and 4, and bytes 2 and 3.
ja: 例えば、xのバイトが１から4に順番付けられるならば、この関数はバイト１と４、そしてバイト２と３をスワップします。

source: For example, if the bytes of x are numbered from 1 to 8, this function swaps bytes 1 and 8, bytes 2 and 7, bytes 3 and 6, and bytes 4 and 5.
ja: 例えば、xのバイトが１から８に順番付けられるならば、この関数はバイト１と８、バイト２と７、バイト３と６、そしてバイト４と５をスワップします。

source: For example, if the current directory is /tmp and you specify a relative pathname of reports/info .txt, the resulting full path for the item is /tmp/reports/info .txt.
ja: 例えば、現在のディレクトリが/tmpであり、そしてあなたが相対パス名のreports/info .txtを指定するならば、結果としてその項目に対する完全パスは/tmp/reports/info .txtになります。

source: For example, if the current user’s preferred language is French, the following code fragment logs the name Bibliothèque and not the name Library, which is the actual name of the directory.
ja: 例えば、現在のユーザの優先言語がFrenchならば、以下のコード断片は名前Bibliothèqueを記録して、名前Libraryをそうしません、それはディレクトリの実際の名前です。

source: For example, if the expression is case sensitive, allows comments, ignores metacharacters, etc.
ja: 例えば、その表現が大文字小文字を考慮するか、コメントを許可するか、メタ文字を無視するか、など。

source: For example, if the formatter allows the display of minutes and seconds, creating an abbreviated string for the value 70 seconds results in the string “1m 10s”.
ja: 例えば、フォーマッタが分と秒の表示を許されるならば、値70秒の省略文字列の作成は、文字列 “1m 10s” という結果になります。

source: For example, if the property is a to-many relationship, value will always be an array of objects to be copied, and this method must therefore return an array of objects.
ja: 例えば、そのプロパティが対多関係ならば、valueは常にオブジェクトの配列でコピーされることになります。そしてこのメソッドは従ってオブジェクトの配列を返さなければなりません。

source: For example, if the server sends a content-length header, it is automatically adjusted to be Content-Length.
ja: 例えば、サーバーがcontent-lengthヘッダを送るならば、それは自動的にContent-Lengthになるように調整されます。

source: For example, if there is exactly one hour and ten minutes difference between the start and end dates, generating an abbreviated string would result in a string of “1h 10m”.
ja: 例えば、正確に１時間と10分の差が開始と終了日付の間にあるならば、生成する省略文字列は “1h 10m” の文字列という結果になるでしょう。

source: For example, if you have an object whose class is defined in a bundle, you must release that object prior to unloading the bundle.
ja: 例えば、それの持つクラスがバンドル内で定義されるオブジェクトをあなたが持つならば、あなたはバンドルがアンロードされる前にそのオブジェクトを解放しなければなりません。

source: For example, if you link to a framework, you can use the init(for:) method to locate the framework bundle based on a class defined in that framework.
ja: 例えば、あなたがあるフレームワークにリンクするならば、あなたはinit(for:)メソッドを使って、そのフレームワークの中で定義されるあるクラスに基づいてそのフレームワークバンドルを捜し出します。

source: For example, if you set the header X-foo, and then later set the header X-Foo, the dictionary’s key will be X-foo, but the value will taken from the X-Foo header.
ja: 例えば、あなたがヘッダX-fooを設定する、それから後でヘッダX-Fooを設定するならば、辞書の持つキーはX-fooになるでしょう、しかし値はX-Fooヘッダから取られるでしょう。

source: For example, if you want to show the month, day, and year without showing the time, you would set the date Style property to long and the time Style property to none.
ja: 例えば、あなたが月、日、そして年の表示を、時間表示なしに望むならば、あなたはdate Styleプロパティをlongに、time Styleプロパティをnoneに設定するでしょう。

source: For example, if your application project contains a help file named Copy .rtf, you would retrieve the text from this file by passing the value @"Copy .rtf" to the key parameter.
ja: 例えば、あなたのアプリケーションプロジェクトがCopy .rtfと命名されるヘルプファイルを含むならば、あなたはこのファイルからテキストを、値@"Copy .rtf"をkeyパラメータに渡すことによって回収します。

source: For example, if your bundle contains files named button .png, button@2x .png, and button .pdf then image For Resource:@"button" returns an NSImage object backed by all three files.
ja: 例えば、あなたのバンドルがbutton .png、button@2x .png、そしてbutton .pdfと命名されるファイルを含むならば、そのときimage For Resource:@"button"は３つのファイル全てが背後にあるNSImageオブジェクトを返します。

source: For example, instead of determining whether object one is less than object two, Cocoa determines whether object two is greater than object one (but only for the operations is equal, is less than or equal, is less than, is greater than or equal, or is greater than).
ja: 例えば、第１オブジェクトが第２オブジェクトより小さいかどうか判定する代わりに、Cocoaは第２オブジェクトが第１オブジェクトより大きいかどうか判定します（しかし演算 is equal、is less than or equal、is less than、is greater than or equal、またはis greater thanに対してのみ）。

source: For example, most events in the Standard suite have the four-character code 'core' (defined as the constant k AECore Suite in AE .framework, a subframework of Application Services .framework).
ja: 例えば、Standardスイートの中のほとんどのイベントは、４文字コードの'core'（Application Services .frameworkの下位フレームワークAE .frameworkにおいて定数k AECore Suiteとして定義されるもの）を持ちます。

source: For example, one hour and ten minutes is displayed in the U.S. English locale as “1:10:00”.
ja: 例えば、１時間と10分は、U.S. Englishロケールでは “1:10:00” として表示されます。

source: For example, pass .hour to check if two dates are in the same hour.
ja: 例えば、.hourを渡して、２つの日付が同じ時間であるか調べてください。。

source: For example, pass in Date(), if you want the start of today.
ja: 例えば、Date()に渡してください、あなたが今日の始まりを望むならば。

source: For example, replacing an RTF document with an RTFD document requires the creation of a new file.
ja: 例えば、RTF書類をRTFD書類で置き換えることは、新しいファイルの作成を必要とします。

source: For example, setting the Weekday to Thursday usually will require the Day component to change its value, and possibly the Month and Year as well.
ja: 例えば、「曜日」を「火曜日」に設定することは普通は「日」構成要素にそれの値を変更することを要求します、そしてことによると「月」と「年」もまた。

source: For example, setting the directory to application Directory, will return the Applications directories in the requested domain.
ja: 例えば、ディレクトリをapplication Directoryに設定すると、要請された領域におけるApplicationsディレクトリを返すでしょう。

source: For example, some apps only need to make calls to a remote network API and do not need to decode a response containing the same type.
ja: 例えば、いくつかのアプリはリモートネットワークAPIへの呼び出しだけを必要として、同じ型を含んでいる返答をデコードする必要がありません。

source: For example, speed can be measured in furlongs per fortnight (1 fur/ftn = 201.168 m / 1,209,600 s).
ja: 例えば、速度はファーロング毎２週間で測定できます（1 fur/ftn = 201.168 m / 1,209,600 s）。

source: For example, suppose you have a Mac app with a modern bundle and you specify @"Documentation" for the subpath parameter.
ja: 例えば、あなたがモダンバンドルを持つMacアプリを持つと仮定すると、あなたは@"Documentation"をsubpathパラメータに対して指定します。

source: For example, the 6th day of the 53rd week of the year 2005 (ISO 2005-W53-6) corresponds to Sat 1 January 2005 on the Gregorian calendar.
ja: 例えば、2005年の53番目の週の６番目の日（ISO 2005-W53-6）は、グレゴリオ暦での2005年１月１日木曜日に相当します。

source: For example, the Unit Illuminance class defines its base Unit in terms of the lux (lx), and provides a corresponding lux class method.
ja: 例えば、Unit Illuminanceクラスは、それのbase Unitをルクス（lx）に基づいて定義します、そして対応するluxクラスメソッドを提供します。

source: For example, the open Apple event from the Standard suite has the four-character code 'odoc' (defined as the constant k AEOpen in AE .framework, a subframework of Application Services .framework).
ja: 例えば、Standardスイートのopenアップルイベントは、４文字コードの'odoc'（定数k AEOpenとしてAE .framework、Application Services .frameworkの下位フレームワーク、において定義されるもの）を持ちます。

source: For example, the Landmark structure can be encoded using both the Property List Encoder and JSONEncoder classes, even though Landmark itself contains no code to specifically handle property lists or JSON.
ja: 例えば、Landmark構造体は、Property List EncoderとJSONEncoderクラスの両方を使ってエンコードされます、Landmarkそれ自身がプロパティリストまたはJSONを具体的に取り扱うコードを含まないとしてもです。

source: For example, the smoot is a nonstandard unit of length (1 smoot = 1.70180 m).
ja: 例えば、smootは長さの非標準単位です（1 smoot = 1.70180 m）。

source: For example, the NSLengthUnit class uses meters as its base unit.
ja: 例えば、NSLengthUnitクラスはmetersをそれの基本単位として使います。

source: For example, the Foundation framework does not define any units for radioactivity.
ja: 例えば、Foundationは放射能に対する単位を全く定義しません。

source: For example, the following code example creates an array containing the elements found in the first half of whole Array (assuming whole Array exists).
ja: 例えば、以下のコード例はwhole Arrayの前半で見つけられる要素を含んでいる配列を作成します（whole Arrayが存在すると仮定して）。

source: For example, the following code results in temporary Directory URL with a value in the form of /private/var/folders/d0/h37cw8ns3h1bfr_2gnwq2yyc0000gn/T/Temporary Items/Untitled/:
ja: 例えば、以下のコードはtemporary Directory URLという結果になり、/private/var/folders/d0/h37cw8ns3h1bfr_2gnwq2yyc0000gn/T/Temporary Items/Untitled/の形式の値を持ちます：

source: For example, the formatter uses this calendar when formatting an Time Interval value.
ja: 例えば、フォーマッタはこのカレンダーを、Time Interval値を書式設定する場合に使います。

source: For example, the quantity of 3 years, 9 months, 26 days, 19 hours, and 17 seconds is displayed in the U.S. English locale as “3 years, 9 months, 26 days, 19 hours, 17 seconds”.
ja: 例えば、３年、９ヶ月、26日、19時間、そして17秒の量は、U.S. Englishロケールでは “3 years, 9 months, 26 days, 19 hours, 17 seconds” として表示されます。

source: For example, the quantity of 3 years, 9 months, 26 days, 19 hours, and 17 seconds is displayed in the U.S. English locale as “3 yrs, 9 mths, 26 days, 19 hr, 17 sec”.
ja: 例えば、３年、９ヶ月、26日、19時間、そして17秒の量は、U.S. Englishロケールでは “3 yrs, 9 mths, 26 days, 19 hr, 17 sec” として表示されます。

source: For example, the quantity of 3 years, 9 months, 26 days, 19 hours, and 17 seconds is displayed in the U.S. English locale as “3y 9mo 26d 19h 17s”.
ja: 例えば、３年、９ヶ月、26日、19時間、そして17秒の量は、U.S. Englishロケールでは “3y 9mo 26d 19h 17s” として表示されます。

source: For example, the quantity of 3 years, 9 months, 26 days, 19 hours, and 17 seconds is displayed in the U.S. English locale as “3yrs 9mths 26days 19hr 17sec”.
ja: 例えば、３年、９ヶ月、26日、19時間、そして17秒の量は、U.S. Englishロケールでは “3yrs 9mths 26days 19hr 17sec” として表示されます。

source: For example, the quantity of 3 years, 9 months, 26 days, 19 hours, and 17 seconds is displayed in the U.S. English locale as “three years, nine months, twenty-six days, nineteen hours, seventeen seconds”.
ja: 例えば、３年、９ヶ月、26日、19時間、そして17秒の量は、U.S. Englishロケールでは “three years, nine months, twenty-six days, nineteen hours, seventeen seconds” として表示されます。

source: For example, the string "(N/A)" contains the pattern metacharacters (, /, and ).
ja: 例えば、文字列"(N/A)"は、パターン・メタ文字(、/、そして)を含みます。

source: For example, the time 00:45 is in the first hour of the day, and for components hour and day respectively, the result would be 1.
ja: 例えば、時刻00:45はその日の最初の１時間の中です、そして構成要素hourとdayそれぞれに対して、結果は１になるでしょう。

source: For example, this playground shows how to map the "product_name" key in the JSON below to the name property on Grocery Product:
ja: 例えば、このプレイグラウンドは、下のJSONの中の"product_name"キーを、Grocery Productでのnameプロパティにマップします：

source: For example, to get the reversed version of a string, reverse its characters and initialize a new String instance from the result.
ja: 例えば、ある文字列の逆版を得るには、それの文字を逆にして、新しいStringインスタンスをその結果から初期化してください。

source: For example, to specify the bundle directory for a Mac app, you might specify the path /Applications/My App .app.
ja: 例えば、あるMacアプリに対するバンドルディレクトリを指定するには、あなたはバス/Applications/My App .appを指定するかもしれません。

source: For example, using a Partial Range From range expression with an array accesses the subrange from the start of the range expression until the end of the array.
ja: 例えば、Partial Range From範囲式をある配列で使うことは、その下位範囲に範囲式の始まりから配列の終わりまでにアクセスします。

source: For example, when creating a file handle for a socket, you would pass the value returned by the socket function.
ja: 例えば、ファイルハンドルをソケットに対して作成する場合、あなたはソケット関数によって返される値を渡すことになります。

source: For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour and 10 seconds is displayed as “1h 10s”.
ja: 例えば、日、時、分、そして秒が認められる場合、１時間と10秒の省略版は “1h 10s” のように表示されます。

source: For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour is displayed as “0d 1h”.
ja: 例えば、日、時、分、そして秒が認められる場合、１時間の省略版は “0d 1h” のように表示されます。

source: For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour is displayed as “1h”.
ja: 例えば、日、時、分、そして秒が認められる場合、１時間の省略版は “1h” のように表示されます。

source: For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour, zero minutes, and five seconds is displayed as “0d 1h 5s”.
ja: 例えば、日、時、分、そして秒が認められる場合、１時間、ゼロ分、そして５秒の省略版は “0d 1h 5s” のように表示されます。

source: For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of ten minutes is displayed as “10m 0s”.
ja: 例えば、日、時、分、そして秒が認められる場合、10分の省略版は “10m 0s” のように表示されます。

source: For example, when loading images, you store images in asset catalogs and load them using the init(named:) methods of UIImage or NSImage.
ja: 例えば、画像をロードする場合、あなたは画像をアセットカタログの中に格納して、それらをUIImageまたはNSImageのinit(named:)メソッドを使ってロードします。

source: For example, when the formatting behavior is drop Trailing, the value of one hour, ten minutes, and zero seconds would omit the mention of seconds.
ja: 例えば、書式設定挙動がdrop Trailingである時、１時間、10分、そしてゼロ秒の値は、秒に言及することを省きます。

source: For example, with a host name "sales" in the domain "anycorp .com", an Host object can hold both the names "sales" and "sales .anycorp .com".
ja: 例えば、ホスト名"sales"はドメイン"anycorp .com"において、あるHostオブジェクトが名前"sales"と"sales .anycorp .com"の両方を持つことができます。

source: For example, with hours, minutes, and seconds displayed, the value for one hour and 10 seconds is “1:00:10”.
ja: 例えば、時、分、そして秒の表示では、１時間と10秒の値は “1:00:10” です。

source: For example, with this property set to 2, instead of “1h 10m, 30s”, the resulting string would be “1h 10m”.
ja: 例えば、このプロパティを２に設定すると、“1h 10m, 30s” の代わりに、結果文字列は “1h 10m” になるでしょう。

source: For example, you can use this method on an array of integers to filter adjacent equal entries or count frequencies.
ja: 例えば、あなたはこのメソッドを整数からなる配列で使うことで、隣接する同等の項目をフィルタしたり頻度を数えたりできます。

source: For example, you can use this method on an array of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値からなる配列で使うことで、それらの合計を見つけるまたは生成できます。

source: For example, you could have a custom formatter that ensures that serial numbers entered by a user conform to predefined formats.
ja: 例えば、あなたは、ユーザによって入力されるシリアルナンバーがあらかじめ定義された形式に従うことを確実にするあつらえのフォーマッタを持つことができます。

source: For example, you could rewrite the file modification statement in the code example above as:
ja: 例えば、あなたは上のコード例のファイル修正文をこのように書き直すことができます：

source: For example, you might use this method to determine if the specified item is in the user’s Documents directory or is in the trash.
ja: 例えば、あなたはこのメソッドを使って、指定された項目がユーザのDocumentsディレクトリの中にあるまたはゴミ箱の中にあるかを決定するかもしれません。

source: For example:
ja: 例えば：

source: For explanations of the possible return values and rounding modes, see NSDecimal Add(_: _: _: _:).
ja: 可能な戻り値と丸めモードの説明として、NSDecimal Add(_: _: _: _:)を見てください。

source: For explanations of the possible return values, see NSDecimal Add(_: _: _: _:).
ja: 可能な戻り値の説明として、NSDecimal Add(_: _: _: _:)を見てください。

source: For files located in an app’s sandbox, this involves physically removing the file from the sandbox container.
ja: アプリのサンドボックスの中に位置するファイルに対して、これは物理的にファイルをサンドボックスコンテナから削除します。

source: For files, this method checks to see if they’re the same file, then compares their size, and finally compares their contents.
ja: ファイルに対して、このメソッドはそれらが同じファイルかどうか見るため調査して、それからそれらの大きさを比較して、最後にそれらの内容を比較します。

source: For files, you can read, write, and seek within the file.
ja: ファイルに対して、あなたは読み、書き、そしてファイル内部のシークが可能です。

source: For fixed format representations of dates and times, you can specify a custom format string.
ja: 日付と時刻の固定形式の表現に対して、あなたは誂えの形式文字列を指定できます。

source: For full details, see Date and Time Programming Guide.
ja: 完全な詳細として、Date and Time Programming Guideを見てください。

source: For historical reasons, alloc invokes alloc With Zone:.
ja: 歴史的な理由のために、allocはalloc With Zone:を発動します。

source: For iOS and for macOS applications linked against macOS 10.5 and later, the default is NSDate Formatter Behavior10_4.
ja: iOSに対してそしてmacOS 10.5以降と組み合わされるmacOSアプリケーションに対して、初期状態ではNSDate Formatter Behavior10_4です。
